export default {
  common_empty_state: {
    progress: {
      title: "Ще немає метрик прогресу для відображення.",
      description:
        "Почніть встановлювати значення властивостей у робочих елементах, щоб побачити тут метрики прогресу.",
    },
    updates: {
      title: "Ще немає оновлень.",
      description: "Як тільки учасники проєкту додадуть оновлення, вони з'являться тут",
    },
    search: {
      title: "Немає відповідних результатів.",
      description: "Результатів не знайдено. Спробуйте змінити пошукові терміни.",
    },
    not_found: {
      title: "Ой! Щось здається не так",
      description: "Ми не можемо отримати ваш обліковий запис plane зараз. Це може бути помилка мережі.",
      cta_primary: "Спробуйте перезавантажити",
    },
    server_error: {
      title: "Помилка сервера",
      description: "Ми не можемо підключитися та отримати дані з нашого сервера. Не хвилюйтеся, ми працюємо над цим.",
      cta_primary: "Спробуйте перезавантажити",
    },
  },
  project_empty_state: {
    no_access: {
      title: "Схоже, у вас немає доступу до цього проєкту",
      restricted_description: "Зверніться до адміністратора, щоб запросити доступ, і ви зможете продовжити тут.",
      join_description: "Натисніть кнопку нижче, щоб приєднатися.",
      cta_primary: "Приєднатися до проєкту",
      cta_loading: "Приєднання до проєкту",
    },
    invalid_project: {
      title: "Проєкт не знайдено",
      description: "Проєкт, який ви шукаєте, не існує.",
    },
    work_items: {
      title: "Почніть з вашого першого робочого елемента.",
      description:
        "Робочі елементи є будівельними блоками вашого проєкту — призначайте власників, встановлюйте пріоритети та легко відстежуйте прогрес.",
      cta_primary: "Створіть свій перший робочий елемент",
    },
    cycles: {
      title: "Групуйте та обмежуйте за часом вашу роботу в Циклах.",
      description:
        "Розділіть роботу на часові блоки, працюйте назад від кінцевого терміну проєкту для встановлення дат і робіть відчутний прогрес як команда.",
      cta_primary: "Встановіть свій перший цикл",
    },
    cycle_work_items: {
      title: "Немає робочих елементів для відображення в цьому циклі",
      description:
        "Створіть робочі елементи, щоб почати моніторинг прогресу вашої команди в цьому циклі та досягти своїх цілей вчасно.",
      cta_primary: "Створити робочий елемент",
      cta_secondary: "Додати існуючий робочий елемент",
    },
    modules: {
      title: "Відобразіть цілі вашого проєкту на Модулі та легко відстежуйте.",
      description:
        "Модулі складаються з взаємопов'язаних робочих елементів. Вони допомагають моніторити прогрес через фази проєкту, кожна з конкретними термінами та аналітикою, щоб показати, наскільки ви близькі до досягнення цих фаз.",
      cta_primary: "Встановіть свій перший модуль",
    },
    module_work_items: {
      title: "Немає робочих елементів для відображення в цьому Модулі",
      description: "Створіть робочі елементи, щоб почати моніторинг цього модуля.",
      cta_primary: "Створити робочий елемент",
      cta_secondary: "Додати існуючий робочий елемент",
    },
    views: {
      title: "Зберігайте власні подання для вашого проєкту",
      description:
        "Подання є збереженими фільтрами, які допомагають вам швидко отримувати доступ до інформації, яку ви використовуєте найчастіше. Співпрацюйте без зусиль, оскільки члени команди діляться та адаптують подання до своїх конкретних потреб.",
      cta_primary: "Створити подання",
    },
    no_work_items_in_project: {
      title: "У проєкті ще немає робочих елементів",
      description:
        "Додайте робочі елементи до свого проєкту та розділіть свою роботу на відстежувані частини з поданнями.",
      cta_primary: "Додати робочий елемент",
    },
    work_item_filter: {
      title: "Робочих елементів не знайдено",
      description: "Ваш поточний фільтр не повернув результатів. Спробуйте змінити фільтри.",
      cta_primary: "Додати робочий елемент",
    },
    pages: {
      title: "Документуйте все — від нотаток до PRD",
      description:
        "Сторінки дозволяють вам захоплювати та організовувати інформацію в одному місці. Пишіть нотатки зустрічей, проєктну документацію та PRD, вбудовуйте робочі елементи та структуруйте їх за допомогою готових компонентів.",
      cta_primary: "Створіть свою першу Сторінку",
    },
    archive_pages: {
      title: "Ще немає архівованих сторінок",
      description: "Архівуйте сторінки, які не на вашому радарі. Отримуйте до них доступ тут, коли потрібно.",
    },
    intake_sidebar: {
      title: "Реєструйте запити на вхід",
      description:
        "Надсилайте нові запити для перегляду, встановлення пріоритетів та відстеження в рамках робочого процесу вашого проєкту.",
      cta_primary: "Створити запит на вхід",
    },
    intake_main: {
      title: "Виберіть робочий елемент Intake, щоб переглянути його деталі",
    },
  },
  workspace_empty_state: {
    archive_work_items: {
      title: "Ще немає архівованих робочих елементів",
      description:
        "Вручну або через автоматизацію ви можете архівувати завершені або скасовані робочі елементи. Знайдіть їх тут після архівування.",
      cta_primary: "Налаштувати автоматизацію",
    },
    archive_cycles: {
      title: "Ще немає архівованих циклів",
      description: "Щоб упорядкувати свій проєкт, архівуйте завершені цикли. Знайдіть їх тут після архівування.",
    },
    archive_modules: {
      title: "Ще немає архівованих Модулів",
      description:
        "Щоб упорядкувати свій проєкт, архівуйте завершені або скасовані модулі. Знайдіть їх тут після архівування.",
    },
    home_widget_quick_links: {
      title: "Тримайте під рукою важливі посилання, ресурси або документи для вашої роботи",
    },
    inbox_sidebar_all: {
      title: "Оновлення для ваших підписаних робочих елементів з'являться тут",
    },
    inbox_sidebar_mentions: {
      title: "Згадки для ваших робочих елементів з'являться тут",
    },
    your_work_by_priority: {
      title: "Ще не призначено робочого елемента",
    },
    your_work_by_state: {
      title: "Ще не призначено робочого елемента",
    },
    views: {
      title: "Ще немає Поданнь",
      description:
        "Додайте робочі елементи до свого проєкту та використовуйте подання для фільтрування, сортування та моніторингу прогресу без зусиль.",
      cta_primary: "Додати робочий елемент",
    },
    drafts: {
      title: "Напівнаписані робочі елементи",
      description:
        "Щоб спробувати це, почніть додавати робочий елемент і залиште його на половині або створіть свій перший чернетка нижче. 😉",
      cta_primary: "Створити чернетковий робочий елемент",
    },
    projects_archived: {
      title: "Немає архівованих проєктів",
      description: "Схоже, всі ваші проєкти все ще активні—чудова робота!",
    },
    analytics_projects: {
      title: "Створіть проєкти для візуалізації метрик проєкту тут.",
    },
    analytics_work_items: {
      title:
        "Створіть проєкти з робочими елементами та призначеними особами, щоб почати відстежувати ефективність, прогрес та вплив команди тут.",
    },
    analytics_no_cycle: {
      title: "Створіть цикли для організації роботи в часові фази та відстеження прогресу через спринти.",
    },
    analytics_no_module: {
      title: "Створіть модулі для організації вашої роботи та відстеження прогресу через різні фази.",
    },
    analytics_no_intake: {
      title:
        "Налаштуйте вхід для управління вхідними запитами та відстеження того, як вони приймаються та відхиляються",
    },
  },
  settings_empty_state: {
    estimates: {
      title: "Ще немає оцінок",
      description:
        "Визначте, як ваша команда вимірює зусилля, та відстежуйте це послідовно для всіх робочих елементів.",
      cta_primary: "Додати систему оцінок",
    },
    labels: {
      title: "Ще немає міток",
      description:
        "Створіть персоналізовані мітки для ефективної категоризації та управління вашими робочими елементами.",
      cta_primary: "Створіть свою першу мітку",
    },
    exports: {
      title: "Ще немає експортів",
      description:
        "Ви зараз не маєте жодних записів експорту. Як тільки ви експортуєте дані, усі записи з'являться тут.",
    },
    tokens: {
      title: "Ще немає Персонального токена",
      description:
        "Генеруйте безпечні API токени для підключення вашого робочого простору до зовнішніх систем та додатків.",
      cta_primary: "Додати API токен",
    },
    webhooks: {
      title: "Ще не додано Webhook",
      description: "Автоматизуйте сповіщення зовнішнім сервісам, коли відбуваються події проєкту.",
      cta_primary: "Додати webhook",
    },
  },
} as const;
